//printf() 함수를 사용하여 모든 데이터형을 출력하는 프로그램을 작성하세요.
#include <stdio.h>

void main(void) {
	int i;
	char* pi;
	char* string = "books";

	//문자, 정수값
	printf("[%c]\n", 'A'); //[A]
	printf("[%d]\n", 7); //[7]
	printf("[%i]\n", 7); //[7]
	printf("[%5d]\n", 7); //[    7] 정수값 출력 시 최소5자리, 오른쪽 맞춤, 빈자리는 공백, 초과시 자동확장
	printf("[%05d]\n", 7); //[00007]
	printf("[%+d]\n", -12345); //[-12345]
	printf("[%+d]\n", 12345); //[+12345] 부호표시
	printf("[%u]\n", 12345); //[12345]
	printf("[%u]\n", -12345); //[4294954951]

	//8진수, 16진수
	printf("[%x]\n", 0xFF); //[ff]
	printf("[%X]\n", 0xFF); //[FF]
	printf("[%#x]\n", 0xFF); //[0xFF]
	printf("[%#x]\n", 12345); //[0x3039]
	printf("[%o]\n", 0123); //[123]
	printf("[%#o]\n", 0123); //[0123] 선두에 숫자문자 '0'

	//고정소수점
	printf("[%f]\n", 3.141592); //[3.141592] 보통 6자리까지만 출력 7자리부터는 반올림
	printf("[%5f]\n", 3.141592); //[3.141592]
	printf("[%.f]\n", 3.141592); //[3]
	printf("[%.2f]\n", 3.141592); //[3.14]
	printf("[%2.2f]\n", 3.141592); //[3.14]
	printf("[%5.5f]\n", 3.141592); //[3.14159]
	printf("[%20.5f]\n", 3.141592); //[             3.14159]
	printf("[%-20.5f]\n", 3.141592); //[3.14159             ] 왼쪽에 맞춰서 출력

	//부동소수점
	printf("[%e]\n", 3.141592); //[3.141592e+00]
	printf("[%E]\n", 3.141592); //[3.141592E+00]
	printf("[%5e]\n", 3.141592); //[3.141592e+00]
	printf("[%.e]\n", 3.141592); //[3e+00]
	printf("[%.2e]\n", 3.141592); //[3.14e+00]
	printf("[%2.2e]\n", 3.141592); //[3.14e+00]
	printf("[%5.5e]\n", 3.141592); //[3.14159e+00]
	printf("[%20.5e]\n", 3.141592); //[         3.14159e+00]
	printf("[%20.2E]\n", 1.2e+10); //[            1.20E+10]
	printf("[%-20.2E]\n", 1.2e+10); //[1.20E+10            ]

	//스마트형
	printf("[%g]\n", 3.141592); //[3.14159] %f와 %e중 좀 더 간소한 출력을 자동으로 결정

	//문자열형
	printf("[%s]\n", string); //[books]
	printf("[%10s]\n", string); //[     books]
	printf("[%-10s]\n", string); //[books     ]
	printf("[%2s]\n", string); //[books]
	printf("[%2.2s]\n", string); //[bo]
	printf("[%3.2s]\n", string); //[ bo] 문자길이 최소3, 출력 문자열은 2자리
	printf("[%010s]\n", string); //[00000books]

	//포인터형
	printf("[%p]\n", &i); //[00BEF938]
	printf("[%p]\n", &pi); //[00BEF92C]
}
//[flags][width][.precision][{h|l|I64|L}]type
//flags, -:왼쪽 정렬 사용, 생략 시 오른쪽 정렬 
//0:width 형식 지정과 함께 사용되며, 남는 공간을 0으로 채움
//#:8진수는 0을 표시 16진수는 0x를 표시, 소수점 포함하여 표시.